load-test/k6/results/test-3/test-3-for-2-min-ingestion-20-vus/insert-app_rust_axum.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\ 
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 2m0s (gracefulStop: 30s)


     _rust_axum.....................: avg=3.961612 min=0.98   med=3.757  max=67.298  p(90)=5.316  p(95)=6
     data_received..................: 105 MB 875 kB/s
     data_sent......................: 111 MB 927 kB/s
     http_req_blocked...............: avg=2.79µs   min=0s     med=2µs    max=1.94ms  p(90)=3µs    p(95)=4µs
     http_req_connecting............: avg=271ns    min=0s     med=0s     max=981µs   p(90)=0s     p(95)=0s
     http_req_duration..............: avg=4ms      min=1.01ms med=3.8ms  max=67.35ms p(90)=5.36ms p(95)=6.05ms
       { expected_response:true }...: avg=4ms      min=1.01ms med=3.8ms  max=67.35ms p(90)=5.36ms p(95)=6.05ms
     http_req_failed................: 0.00%  ✓ 0          ✗ 573675
     http_req_receiving.............: avg=32.09µs  min=11µs   med=29µs   max=14.85ms p(90)=43µs   p(95)=54µs
     http_req_sending...............: avg=14.91µs  min=5µs    med=13µs   max=18.1ms  p(90)=20µs   p(95)=23µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s      p(90)=0s     p(95)=0s
     http_req_waiting...............: avg=3.96ms   min=980µs  med=3.75ms max=67.29ms p(90)=5.31ms p(95)=6ms
     http_reqs......................: 573675 4780.52692/s
     iteration_duration.............: avg=4.17ms   min=1.13ms med=3.96ms max=67.54ms p(90)=5.53ms p(95)=6.22ms
     iterations.....................: 573675 4780.52692/s
     vus............................: 20     min=20       max=20
     vus_max........................: 20     min=20       max=20


running (2m00.0s), 00/20 VUs, 573675 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  2m0s